{
  "data": [
    {
      "index": 0,
      "title": "Animal Foster Carer",
      "image": "/static/roles/puppee.jpeg",
      "subtitle": "What is required to be a fosterer?",
      "desc": "It goes without saying that youll need to be an animal lover! As long as you have a little spare time and can offer a suitable environment we’d be happy to hear from you. There is no cost to the fosterer, we provide all the equipment, food, medicine and any vets bills.\n\nOther requirements include:\n– If you have your own pets they must be fully vaccinated, neutered and  happy to share their home.\n– If you are in rented accommodation we must receive written permission from your landlord, confirming that you’re able to keep animals at the property.\n– You’ll need to be over 18.\n\nWe also host a clinic for our foster animals once per week here at the centre for their regular appointments and check-ups. If you have difficulty with transport we can offer a van collection service for this."
    }, {
      "index": 1,
      "title": "Fundraising & Events Crew",
      "image": "/static/roles/person.jpeg",
      "subtitle": "Fundraising & Events Crew",
      "desc": "If you’d really like to volunteer with the RSPCA but are unable to make a regular commitment or prefer something more active, you could be a valuable asset to our Events Crew. Our branch organises or is present at hundreds of events each year, fundraising and promoting the work of your local RSPCA.\n\nWhat would you be doing?\n\nThe Events Crew are kept informed of our upcoming events and also other local events we’ll be attending and can choose which they’re able to help out at. You could be helping run a dog show, taking part in a fundraising collection, speaking to the public at an RSPCA stand or any other activity we’re involved in. Our Events Crew are a real family and you’ll always have the support of our staff and other experienced volunteers.\n\nWho are we looking for?\n\nAnyone can join our Events Crew but these are some criteria you should meet:\n\nPassionate about the work our RSPCA branch does.\nFriendly and comfortable interacting with other volunteers and members of the public\nSome availability, particularly weekends when most of our events take place."
    }, {
      "index": 2,
      "title": "Van Drivers Mate",
      "image": "/static/roles/trucc.jpeg",
      "subtitle": "Would you like to be out and about?",
      "desc": "Do you like to be out and about? We have a number of vans operating across the region, making collections, transferring items or even performing house clearances. Our drivers are fantastic but they do often need help, which is where you come in.\n\nWhat would you be doing?\n\nDriver’s mates typically volunteer for a minimum of a morning, afternoon or full day. You’ll travel out with our drivers to various collection points or pick up stock from one store and deliver it to another.\n\nWho are we looking for?\n\nThis role does require a great deal of lifting and carrying and therefore you’ll need to be;\n\nPhysically fit\nHonest & reliable\nFriendly & helpful\nWilling to work as part of a team"
    }, {
      "index": 3,
      "title": "Home Visitor",
      "image": "/static/roles/otherpup.jpeg",
      "subtitle": "Help us with our home checks",
      "desc": "Help our animals find their new home\nHere at the RSPCA Halifax, Huddersfield, Bradford & District Branch we conduct home visits for each cat, dog, rabbit or guinea pig which is adopted from our animal centre. Our home visiting process is conducted by a team of volunteers who work with us to make sure the right animal is placed in the right home.\n\nWhat is required to be a home visitor?\nHome Visitors must have knowledge of caring for animals and have a basic understanding of their needs and behaviours. Each home visitor will be asked which species of animals they would feel confident conducting a home visit for. Home Visitors have to be over 18 years old and be able to provide their own transport. \n\n“I first started as a Volunteer at RSPCA in 2013, doing dog walking which I thoroughly enjoyed and still do. After doing that for a year I decided I would like to do more so then went on to become a Home Visitor. I absolutely love doing the visits, and meeting some lovely families, it is so nice to see how excited the people get about adopting a dog or cat, and then when doing the post-adoption visit see the animal happy and settled in their new home. Also with the older dogs and cats adopted \non the EARS Scheme, it’s very rewarding to then see that an old dog can live the last few years of its life being loved and looked after so well.”\n\nWhat training is provided?\nEvery home visitor will be required to attend an induction at our Halifax Animal Centre, where they will meet the Rehoming Team and be given all the information needed to become a home visitor, including how to conduct a home visit. Once the induction is complete new home visitors are teamed up with a ‘buddy’ who will be an experienced home visitor and they will attend the first few visits with the new home visitor.  \nWe host regular team meetings at the centre to keep everyone up to date with centre news and offer workshops to build knowledge of animal care."
    }, {
      "index": 4,
      "title": "Retail Assistant",
      "image": "/static/roles/shop.jpeg",
      "subtitle": "Our shops need you!",
      "desc": "We operate 11 charity shops across the region, in Halifax, Huddersfield, Bradford, Brighouse, Cleckheaton, Holmfirth, Hebden Bridge, Marsh and Pudsey. These shops are a huge part of our fundraising efforts, as well as providing a visible presence in our communities.\n\nWhat would you be doing?\n\nOur retail assistants make a valuable contribution in running our charity shops, with tasks including sorting stock, operating the till, serving customers and other adhoc tasks as they arise. Volunteering as a retail assistant can be a great opportunity to spend some time contributing to our cause, meeting other likeminded volunteers and gaining retail experience which might help you develop new career opportunities.\n\nWho are we looking for?\n\nPrevious retail experience is not necessary, all we ask for is reliability, enthusiasm and a willingness to work as part of a team. How much you volunteer is entirely up to you, all we ask is that you make a regular commitment and keep in touch with us should any issues arise."
    }, {
      "index": 5,
      "title": "eBay Assistant",
      "image": "/static/roles/ebayyy.jpeg",
      "subtitle": "Making the most of our donations",
      "desc": "Can you spare a couple of hours each week?\n\nWe’re looking for enthusiastic volunteers to join our friendly eBay team. Some of our donations are more easy to sell or raise more money for the charity when sold via online platforms such as eBay or Music Magpie. \n\nWhat would you be doing?\n\nWorking with our eBay Sales Manager, duties could include:\n\n• Researching items for sale\n• Photographing items to sell\n• Listing items for sale on eBay\n• Selling items on Music Magpie\n• Packaging & posting items that have sold\n\nWho are we looking for?\n\nPrevious experience is not necessary, all we ask for is reliability, enthusiasm and a willingness to work as part of a team. Being a largely online role, a reasonable level of IT literacy is beneficial and particularly if you have experience of online selling platforms. How much you volunteer is entirely up to you, all we ask is that you make a regular commitment and keep in touch with us should any issues arise. "
    }
  ]
}
